app/controllers/users_controller.rb

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  ORDER BY "tweets"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]
---
  def show
    @tweet = current_user.tweets.build if signed_in?
    @feed_items = @user.tweets.paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "password_digest", "slug", "created_at", "updated_at", "remember_token") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "santimola@mucho.com"], ["password_digest", "$2a$10$ABcnceFWXFvVz5yVreSLju60bA0eE6EPgBSD6vAIxeDhvimQ8CoVm"], ["updated_at", "2015-05-11 11:22:42.631978"], ["id", 6]]
---
  def update
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."slug" = ? LIMIT 1  [["slug", "Manolo69"]]
---
    def set_user
      @user = User.find_by!(slug: params[:id])